modm-ext/archive-stmicro-svd/header_stm32l4r9agi6.svd
        <register>
          <name>LUT.292</name>
          <addressOffset>0x1490</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.293</name>
          <addressOffset>0x1494</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.294</name>
          <addressOffset>0x1498</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.295</name>
          <addressOffset>0x149c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.296</name>
          <addressOffset>0x14a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.297</name>
          <addressOffset>0x14a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.298</name>
          <addressOffset>0x14a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.299</name>
          <addressOffset>0x14ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.300</name>
          <addressOffset>0x14b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.301</name>
          <addressOffset>0x14b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.302</name>
          <addressOffset>0x14b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.303</name>
          <addressOffset>0x14bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.304</name>
          <addressOffset>0x14c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.305</name>
          <addressOffset>0x14c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.306</name>
          <addressOffset>0x14c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.307</name>
          <addressOffset>0x14cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.308</name>
          <addressOffset>0x14d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.309</name>
          <addressOffset>0x14d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.310</name>
          <addressOffset>0x14d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.311</name>
          <addressOffset>0x14dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.312</name>
          <addressOffset>0x14e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.313</name>
          <addressOffset>0x14e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.314</name>
          <addressOffset>0x14e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.315</name>
          <addressOffset>0x14ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.316</name>
          <addressOffset>0x14f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.317</name>
          <addressOffset>0x14f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.318</name>
          <addressOffset>0x14f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.319</name>
          <addressOffset>0x14fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.320</name>
          <addressOffset>0x1500</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.321</name>
          <addressOffset>0x1504</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.322</name>
          <addressOffset>0x1508</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.323</name>
          <addressOffset>0x150c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.324</name>
          <addressOffset>0x1510</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.325</name>
          <addressOffset>0x1514</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.326</name>
          <addressOffset>0x1518</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.327</name>
          <addressOffset>0x151c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.328</name>
          <addressOffset>0x1520</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.329</name>
          <addressOffset>0x1524</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.330</name>
          <addressOffset>0x1528</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.331</name>
          <addressOffset>0x152c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.332</name>
          <addressOffset>0x1530</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.333</name>
          <addressOffset>0x1534</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.334</name>
          <addressOffset>0x1538</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.335</name>
          <addressOffset>0x153c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.336</name>
          <addressOffset>0x1540</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.337</name>
          <addressOffset>0x1544</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.338</name>
          <addressOffset>0x1548</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.339</name>
          <addressOffset>0x154c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.340</name>
          <addressOffset>0x1550</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.341</name>
          <addressOffset>0x1554</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.342</name>
          <addressOffset>0x1558</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.343</name>
          <addressOffset>0x155c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.344</name>
          <addressOffset>0x1560</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.345</name>
          <addressOffset>0x1564</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.346</name>
          <addressOffset>0x1568</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.347</name>
          <addressOffset>0x156c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.348</name>
          <addressOffset>0x1570</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.349</name>
          <addressOffset>0x1574</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.350</name>
          <addressOffset>0x1578</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.351</name>
          <addressOffset>0x157c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.352</name>
          <addressOffset>0x1580</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.353</name>
          <addressOffset>0x1584</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.354</name>
          <addressOffset>0x1588</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.355</name>
          <addressOffset>0x158c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.356</name>
          <addressOffset>0x1590</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.357</name>
          <addressOffset>0x1594</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.358</name>
          <addressOffset>0x1598</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.359</name>
          <addressOffset>0x159c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.360</name>
          <addressOffset>0x15a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.361</name>
          <addressOffset>0x15a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.362</name>
          <addressOffset>0x15a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.363</name>
          <addressOffset>0x15ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.364</name>
          <addressOffset>0x15b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.365</name>
          <addressOffset>0x15b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.366</name>
          <addressOffset>0x15b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.367</name>
          <addressOffset>0x15bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.368</name>
          <addressOffset>0x15c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.369</name>
          <addressOffset>0x15c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.370</name>
          <addressOffset>0x15c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.371</name>
          <addressOffset>0x15cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.372</name>
          <addressOffset>0x15d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.373</name>
          <addressOffset>0x15d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.374</name>
          <addressOffset>0x15d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.375</name>
          <addressOffset>0x15dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.376</name>
          <addressOffset>0x15e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.377</name>
          <addressOffset>0x15e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.378</name>
          <addressOffset>0x15e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.379</name>
          <addressOffset>0x15ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.380</name>
          <addressOffset>0x15f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.381</name>
          <addressOffset>0x15f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.382</name>
          <addressOffset>0x15f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.383</name>
          <addressOffset>0x15fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.384</name>
          <addressOffset>0x1600</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.385</name>
          <addressOffset>0x1604</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.386</name>
          <addressOffset>0x1608</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.387</name>
          <addressOffset>0x160c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.388</name>
          <addressOffset>0x1610</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.389</name>
          <addressOffset>0x1614</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.390</name>
          <addressOffset>0x1618</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.391</name>
          <addressOffset>0x161c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.392</name>
          <addressOffset>0x1620</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.393</name>
          <addressOffset>0x1624</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.394</name>
          <addressOffset>0x1628</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.395</name>
          <addressOffset>0x162c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.396</name>
          <addressOffset>0x1630</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.397</name>
          <addressOffset>0x1634</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.398</name>
          <addressOffset>0x1638</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.399</name>
          <addressOffset>0x163c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.400</name>
          <addressOffset>0x1640</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.401</name>
          <addressOffset>0x1644</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.402</name>
          <addressOffset>0x1648</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.403</name>
          <addressOffset>0x164c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.404</name>
          <addressOffset>0x1650</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.405</name>
          <addressOffset>0x1654</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.406</name>
          <addressOffset>0x1658</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.407</name>
          <addressOffset>0x165c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.408</name>
          <addressOffset>0x1660</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.409</name>
          <addressOffset>0x1664</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.410</name>
          <addressOffset>0x1668</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.411</name>
          <addressOffset>0x166c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.412</name>
          <addressOffset>0x1670</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.413</name>
          <addressOffset>0x1674</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.414</name>
          <addressOffset>0x1678</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.415</name>
          <addressOffset>0x167c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.416</name>
          <addressOffset>0x1680</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.417</name>
          <addressOffset>0x1684</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.418</name>
          <addressOffset>0x1688</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.419</name>
          <addressOffset>0x168c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.420</name>
          <addressOffset>0x1690</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.421</name>
          <addressOffset>0x1694</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.422</name>
          <addressOffset>0x1698</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.423</name>
          <addressOffset>0x169c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.424</name>
          <addressOffset>0x16a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.425</name>
          <addressOffset>0x16a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.426</name>
          <addressOffset>0x16a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.427</name>
          <addressOffset>0x16ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.428</name>
          <addressOffset>0x16b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.429</name>
          <addressOffset>0x16b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.430</name>
          <addressOffset>0x16b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.431</name>
          <addressOffset>0x16bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.432</name>
          <addressOffset>0x16c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.433</name>
          <addressOffset>0x16c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.434</name>
          <addressOffset>0x16c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.435</name>
          <addressOffset>0x16cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.436</name>
          <addressOffset>0x16d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.437</name>
          <addressOffset>0x16d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.438</name>
          <addressOffset>0x16d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.439</name>
          <addressOffset>0x16dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.440</name>
          <addressOffset>0x16e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.441</name>
          <addressOffset>0x16e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.442</name>
          <addressOffset>0x16e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.443</name>
          <addressOffset>0x16ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.444</name>
          <addressOffset>0x16f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.445</name>
          <addressOffset>0x16f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.446</name>
          <addressOffset>0x16f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.447</name>
          <addressOffset>0x16fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.448</name>
          <addressOffset>0x1700</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.449</name>
          <addressOffset>0x1704</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.450</name>
          <addressOffset>0x1708</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.451</name>
          <addressOffset>0x170c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.452</name>
          <addressOffset>0x1710</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.453</name>
          <addressOffset>0x1714</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.454</name>
          <addressOffset>0x1718</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.455</name>
          <addressOffset>0x171c</addressOffset>
          <size>0x20</size>
        </register>
