modm-ext/archive-stmicro-svd/header_stm32l4r9agi6.svd
        <register>
          <name>LUT.1111</name>
          <addressOffset>0x215c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1112</name>
          <addressOffset>0x2160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1113</name>
          <addressOffset>0x2164</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1114</name>
          <addressOffset>0x2168</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1115</name>
          <addressOffset>0x216c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1116</name>
          <addressOffset>0x2170</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1117</name>
          <addressOffset>0x2174</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1118</name>
          <addressOffset>0x2178</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1119</name>
          <addressOffset>0x217c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1120</name>
          <addressOffset>0x2180</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1121</name>
          <addressOffset>0x2184</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1122</name>
          <addressOffset>0x2188</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1123</name>
          <addressOffset>0x218c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1124</name>
          <addressOffset>0x2190</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1125</name>
          <addressOffset>0x2194</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1126</name>
          <addressOffset>0x2198</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1127</name>
          <addressOffset>0x219c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1128</name>
          <addressOffset>0x21a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1129</name>
          <addressOffset>0x21a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1130</name>
          <addressOffset>0x21a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1131</name>
          <addressOffset>0x21ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1132</name>
          <addressOffset>0x21b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1133</name>
          <addressOffset>0x21b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1134</name>
          <addressOffset>0x21b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1135</name>
          <addressOffset>0x21bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1136</name>
          <addressOffset>0x21c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1137</name>
          <addressOffset>0x21c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1138</name>
          <addressOffset>0x21c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1139</name>
          <addressOffset>0x21cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1140</name>
          <addressOffset>0x21d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1141</name>
          <addressOffset>0x21d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1142</name>
          <addressOffset>0x21d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1143</name>
          <addressOffset>0x21dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1144</name>
          <addressOffset>0x21e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1145</name>
          <addressOffset>0x21e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1146</name>
          <addressOffset>0x21e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1147</name>
          <addressOffset>0x21ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1148</name>
          <addressOffset>0x21f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1149</name>
          <addressOffset>0x21f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1150</name>
          <addressOffset>0x21f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1151</name>
          <addressOffset>0x21fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1152</name>
          <addressOffset>0x2200</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1153</name>
          <addressOffset>0x2204</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1154</name>
          <addressOffset>0x2208</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1155</name>
          <addressOffset>0x220c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1156</name>
          <addressOffset>0x2210</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1157</name>
          <addressOffset>0x2214</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1158</name>
          <addressOffset>0x2218</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1159</name>
          <addressOffset>0x221c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1160</name>
          <addressOffset>0x2220</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1161</name>
          <addressOffset>0x2224</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1162</name>
          <addressOffset>0x2228</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1163</name>
          <addressOffset>0x222c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1164</name>
          <addressOffset>0x2230</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1165</name>
          <addressOffset>0x2234</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1166</name>
          <addressOffset>0x2238</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1167</name>
          <addressOffset>0x223c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1168</name>
          <addressOffset>0x2240</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1169</name>
          <addressOffset>0x2244</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1170</name>
          <addressOffset>0x2248</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1171</name>
          <addressOffset>0x224c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1172</name>
          <addressOffset>0x2250</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1173</name>
          <addressOffset>0x2254</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1174</name>
          <addressOffset>0x2258</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1175</name>
          <addressOffset>0x225c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1176</name>
          <addressOffset>0x2260</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1177</name>
          <addressOffset>0x2264</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1178</name>
          <addressOffset>0x2268</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1179</name>
          <addressOffset>0x226c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1180</name>
          <addressOffset>0x2270</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1181</name>
          <addressOffset>0x2274</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1182</name>
          <addressOffset>0x2278</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1183</name>
          <addressOffset>0x227c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1184</name>
          <addressOffset>0x2280</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1185</name>
          <addressOffset>0x2284</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1186</name>
          <addressOffset>0x2288</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1187</name>
          <addressOffset>0x228c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1188</name>
          <addressOffset>0x2290</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1189</name>
          <addressOffset>0x2294</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1190</name>
          <addressOffset>0x2298</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1191</name>
          <addressOffset>0x229c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1192</name>
          <addressOffset>0x22a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1193</name>
          <addressOffset>0x22a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1194</name>
          <addressOffset>0x22a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1195</name>
          <addressOffset>0x22ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1196</name>
          <addressOffset>0x22b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1197</name>
          <addressOffset>0x22b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1198</name>
          <addressOffset>0x22b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1199</name>
          <addressOffset>0x22bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1200</name>
          <addressOffset>0x22c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1201</name>
          <addressOffset>0x22c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1202</name>
          <addressOffset>0x22c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1203</name>
          <addressOffset>0x22cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1204</name>
          <addressOffset>0x22d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1205</name>
          <addressOffset>0x22d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1206</name>
          <addressOffset>0x22d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1207</name>
          <addressOffset>0x22dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1208</name>
          <addressOffset>0x22e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1209</name>
          <addressOffset>0x22e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1210</name>
          <addressOffset>0x22e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1211</name>
          <addressOffset>0x22ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1212</name>
          <addressOffset>0x22f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1213</name>
          <addressOffset>0x22f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1214</name>
          <addressOffset>0x22f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1215</name>
          <addressOffset>0x22fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1216</name>
          <addressOffset>0x2300</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1217</name>
          <addressOffset>0x2304</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1218</name>
          <addressOffset>0x2308</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1219</name>
          <addressOffset>0x230c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1220</name>
          <addressOffset>0x2310</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1221</name>
          <addressOffset>0x2314</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1222</name>
          <addressOffset>0x2318</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1223</name>
          <addressOffset>0x231c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1224</name>
          <addressOffset>0x2320</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1225</name>
          <addressOffset>0x2324</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1226</name>
          <addressOffset>0x2328</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1227</name>
          <addressOffset>0x232c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1228</name>
          <addressOffset>0x2330</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1229</name>
          <addressOffset>0x2334</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1230</name>
          <addressOffset>0x2338</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1231</name>
          <addressOffset>0x233c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1232</name>
          <addressOffset>0x2340</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1233</name>
          <addressOffset>0x2344</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1234</name>
          <addressOffset>0x2348</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1235</name>
          <addressOffset>0x234c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1236</name>
          <addressOffset>0x2350</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1237</name>
          <addressOffset>0x2354</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1238</name>
          <addressOffset>0x2358</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1239</name>
          <addressOffset>0x235c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1240</name>
          <addressOffset>0x2360</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1241</name>
          <addressOffset>0x2364</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1242</name>
          <addressOffset>0x2368</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1243</name>
          <addressOffset>0x236c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1244</name>
          <addressOffset>0x2370</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1245</name>
          <addressOffset>0x2374</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1246</name>
          <addressOffset>0x2378</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1247</name>
          <addressOffset>0x237c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1248</name>
          <addressOffset>0x2380</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1249</name>
          <addressOffset>0x2384</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1250</name>
          <addressOffset>0x2388</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1251</name>
          <addressOffset>0x238c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1252</name>
          <addressOffset>0x2390</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1253</name>
          <addressOffset>0x2394</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1254</name>
          <addressOffset>0x2398</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1255</name>
          <addressOffset>0x239c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1256</name>
          <addressOffset>0x23a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1257</name>
          <addressOffset>0x23a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1258</name>
          <addressOffset>0x23a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1259</name>
          <addressOffset>0x23ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1260</name>
          <addressOffset>0x23b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1261</name>
          <addressOffset>0x23b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1262</name>
          <addressOffset>0x23b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1263</name>
          <addressOffset>0x23bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1264</name>
          <addressOffset>0x23c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1265</name>
          <addressOffset>0x23c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1266</name>
          <addressOffset>0x23c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1267</name>
          <addressOffset>0x23cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1268</name>
          <addressOffset>0x23d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1269</name>
          <addressOffset>0x23d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1270</name>
          <addressOffset>0x23d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1271</name>
          <addressOffset>0x23dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1272</name>
          <addressOffset>0x23e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1273</name>
          <addressOffset>0x23e4</addressOffset>
          <size>0x20</size>
        </register>
